content-org/posts.org
#+hugo_base_dir: ../

** DONE Library                                           :@library:thoughts:
:PROPERTIES:
:EXPORT_FILE_NAME: note1
:EXPORT_DATE: 2025-09-06
:END:

In my first year of college humanities, my class was instructed to keep a commonplace book of quotes and comments for each of our assigned readings to get us thinking critically about them.
This had the effect of making the unit more interesting, but also of making the idea of keeping a commonplace book less attractive.
Still, the idea held some appeal to me.

Over the past couple of years, I have been looking for interesting blogs and websites to follow.
Everybody does this whether they're thinking about it or not, though much of the work is done by the algorithms that we are subject to.
I wanted to remove this element, because, in addition to the well-documented risks and harms of passively being fed information, it just doesn't get me anywhere interesting.
It's not very common anymore to bump into something surprising or exciting on one's daily trundles through cyberspace.
Doing so requires a bit more intentionality—leaping through hyperlinks, I suppose.

In any case, here are some interesting websites, in no particular order.

*** Tech

- [[https://www.citationneeded.news//][Citation Needed]]: I did not find crypto very interesting before this newsletter, but now I do!
  Molly White is very methodical in how she dissects the complex, tangled interests of the crypto industry, which is very important now that crypto is going mainstream.
  
- [[https://www.wheresyoured.at/][Where's Your Ed At]]: I found Ed Zitron's Substack a few months back. He has very interesting things to stay about the present state and trajectory of private-sector AI;
  over the past few months, he has been looking more and more correct.

*** Music

- [[https://thequietus.com/][The Quietus]]: I don't listen to what they push 90% of the time since they're a bit experimental for my tastes but the 10% is a very good 10%.

- [[https://compilationnation.substack.com/][Compilation Nation]]: I picked up an older Compilation Nation zine and it was very good, and this is the same thing but online.

*** Misc
- [[https://kottke.org/][Kottke]]: I don't read most of the posts on here but every so often they post something /really/ interesting and that's often how I discover a new blog.

- [[https://pudding.cool/][The Pudding]]: I don't think journalism gets much more engaging than [[https://pudding.cool/2025/04/music-dna][this]].
