content/notes/note1.md
+++
title = "Library"
author = ["Aahaan Singh"]
date = 2025-09-06
tags = ["thoughts"]
categories = ["library"]
draft = false
+++

In my first year of college humanities, my class was instructed to keep a commonplace book of quotes and comments for each of our assigned readings to get us thinking critically about them.
This had the effect of making the unit more interesting, but also of making the idea of keeping a commonplace book less attractive.
Still, the idea held some appeal to me.

Over the past couple of years, I have been looking for interesting blogs and websites to follow.
Everybody does this whether they're thinking about it or not, though much of the work is done by the algorithms that we are subject to.
I wanted to remove this element, because, in addition to the well-documented risks and harms of passively being fed information, it just doesn't get me anywhere interesting.
It's not very common anymore to bump into something surprising or exciting on one's daily trundles through cyberspace.
Doing so requires a bit more intentionality—leaping through hyperlinks, I suppose.

In any case, here are some interesting websites, in no particular order.


## Tech {#tech}

-   [Citation Needed](https://www.citationneeded.news//): I did not find crypto very interesting before this newsletter, but now I do!
    Molly White is very methodical in how she dissects the complex, tangled interests of the crypto industry, which is very important now that crypto is going mainstream.

-   [Where's Your Ed At](https://www.wheresyoured.at/): I found Ed Zitron's Substack a few months back. He has very interesting things to stay about the present state and trajectory of private-sector AI;
    over the past few months, he has been looking more and more correct.


## Music {#music}

-   [The Quietus](https://thequietus.com/): I don't listen to what they push 90% of the time since they're a bit experimental for my tastes but the 10% is a very good 10%.

-   [Compilation Nation](https://compilationnation.substack.com/): I picked up an older Compilation Nation zine and it was very good, and this is the same thing but online.


## Misc {#misc}

-   [Kottke](https://kottke.org/): I don't read most of the posts on here but every so often they post something _really_ interesting and that's often how I discover a new blog.

-   [The Pudding](https://pudding.cool/): I don't think journalism gets much more engaging than [this](https://pudding.cool/2025/04/music-dna).
